# IsGroupExcluded Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
FabricationService..::..IsGroupExcluded Method
FabricationService Class See Also
---
This method is deprecated in Revit 2022 and and may be removed in a future version of Revit. Please use the `IsPaletteExcluded` method instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
[ObsoleteAttribute]
public bool IsGroupExcluded(
	int groupIndex
)
```

Visual Basic
---
```text
<ObsoleteAttribute> _
Public Function IsGroupExcluded ( _
	groupIndex As Integer _
) As Boolean
```

Visual C++
---
```text
[ObsoleteAttribute]
public:
bool IsGroupExcluded(
	int groupIndex
)
```

# ### Parameters
groupIndex
    Type: System..::..Int32 The index of the group.
# ### Return Value
Returns true if the group indexed by groupIndex is currently to be excluded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index groupIndex is not larger or equal to 0 and less than PaletteCount |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace